const boxContent = {
    1: {
      imgSrc: 'MainPageImages/biznesanalizi.jpg',
      title: 'ბიზნესის ანალიზი',
      text: 'ზურაბ ლიპარტია',
      summary: 'სახელმძღვანელოს - „ბიზნესის ანალიზი-შეფასება და განვითარების პროგნოზირება“ პირველ ნაწილში განხილულია: ბიზნესის ადმისტრირების (მართვის) სისტემასთან ურთიერთდაკავშირებილი ბუღალტრული აღრიცხვის, მიკროეკონომიკური ანალიზის, ბიზნესის ფინანსური მენეჯმენტის მიზნობრივი ანალიზის მეთოდოლოგიურ-გამოყენებითი საკითხები; ბიზნესის (დარგის) განვითარების პროგნოზირების თავისებურებანი; სოციალურ-ეკონომიკური განვითარების სტრატეგიული დაგეგმვისა და პროგნოზირების ფინანსური მექანიზმი.'
    },
    2: {
      imgSrc: 'MainPageImages/korho.png',
      title: 'კორპორაციული სოციალური პასუხისმგებლობა და ეთიკა',
      text: 'ლარისა თაკალანძე',
      summary: 'წინამდებარე ნაშრომი წარმოადგენს 2006 წელს გამოცემული „ბიზნესის სოციალური პასუხისმგებლობის და ეთიკის“ მე-2 შევსებულ და გადამუშავებულ გამოცემას. დამხმარე სახელმძღვანელოში კომპლექსურადაა გადმოცემული კორპორაციული სოციალური პასუხისმგებლობის (კსპ) ძირითადი თეორიულ-მეთოდოლოგიური საკითხები, განზოგადებული და გაანალიზებულია კორპორაციული სოციალური პასუხისმგებლობის მდიდარი უცხოური გამოცდილება; განსაკუთრებული ყურადღება ეთმობა ევროკავშირის პოლიტიკას კსპ-ის სფეროში, სოციალური პასუხისმგებლობის თავისებურებებს ევროკავშირის ქვეყნებში და საუკეთესო პრაქტიკის ქართულ კომპანიებში ადაპტირებას ჩვენი ქვეყნის რეალობის გათვალისწინებით.'
    },
    3: {
      imgSrc: 'MainPageImages/stratmene.png',
      title: 'სტრატეგიული მენეჯმენტი',
      text: 'ზურაბ ლიპარტია',
      summary: 'სახელმძღვანელოს პირველ ნაწილში განხილულია: სტრატეგიულ მენეჯმენტში ურთიერთდაკავშირებული ეკონომიკური, პოლიტიკური, დემოგრაფიული და ეკოლოგიური საკითხები, რომლებიც ქვეყანაში მეწარმეობრივი საქმიანობის წარმატებულ განვითარებას უზრუნველყოფს. '
    },
    4: {
      imgSrc: 'MainPageImages/adamres.png',
      title: 'ადამიანური რესურსების მენეჯმენტი',
      text: 'ბადრი გეჩბაია',
      summary: 'სახელმძღვანელო მომზადებულია ადამიანური რესურსების მენეჯმენტის სფეროში არსებული სამეცნიერო ლიტერატურის გამოყენების საფუძველზე. მასში განხილულია ადამიანური რესურსების მართვის პოლიტიკა და სტრატეგია; კომპეტენტური მიდგომა ადამიანური რესურსების მენეჯმენტისადმი; ორგანიზაციის საკადრო პოლიტიკის საკვანძო საკითხები; ადამიანური რესურსების დაგეგმვა; ადამიანური რესურსების შერჩევისა და გადარჩევის, მოტივაციისა და შრომის ანაზღაურების, პერსონალის ადაპტაციისა და სწავლების, შეფასებისა და საკადრო რეზერვების მართვის მნიშვნელოვანი საკითხები.'
    },
    5: {
      imgSrc: 'MainPageImages/prognoz.jpg',
      title: 'ბიზნესის ანალიზი და განვითარების პროგნოზირება',
      text: 'ზურაბ ლიპარტია',
      summary: 'წარმოდგენილ სასწავლო-პრაქტიკულ სახელმძღვანელოში განხილულია ბიზნესის ადმისტრირების (მართვის) სისტემასთან ურთიერთდაკავშირებილი ბუღალტრული აღრიცხვის, მიკროეკონომიკური (მმართველობითი და ფინანსური) ანალიზის, ბიზნესის (მეწარმეობის) ფინანსური მენეჯმენტის მიზნობრივი ანალიზის მეთოდოლოგიურ-გამოყენებითი საკითხები; ბიზნესის (დარგის) განვითარების პროგნოზირების თავისებურებანი; ფინანსური ანგარიშგების ანალიზის მეთოდურ-გამოყენებითი, კონკურენტული უპირატესობის, სოციალურ-ეკონომიკური განვითარების სტრატეგიული დაგეგმვის-პროგნოზირებისა და ბიზნესის (კომპანიის) ღირებულების შეფასების თანამედროვე მეთოდოლოგიურ-პრაქტიკული ასპექტები.'
    },
    6: {
      imgSrc: 'MainPageImages/sabanko.jpg',
      title: 'საბანკო საქმე',
      text: 'კობა ბასილაია',
      summary: 'ნაშრომი დამუშავებულია საბანკო კანონმდებლობის შესაბამისად. მასში განხილულია საბანკო სისტემის განვითარების ისტორიის, ორგანიზაციის, თანამედროვე საბანკო-საკრედიტო სისტემის, ცენტრალური ბანკის მიერ ფულად-საკრედიტო სისტემის რეგულირების ფორმებისა და მეთოდების, რესურსების მოზიდვასა და განთავსებასთან დაკავშირებული საბანკო ოპერაციების სახეობების, კომერციული ბანკების საქმიანობის ანალიზის, კომერციული ბანკის აქტიური და პასიური ოერაციების, საბანკო მენეჯმენტის მეთოდოლოგიური საფუძვლების, საქართველოს კომერციული ბანკის უნაღდო ანგარიშსწორების, საბანკო დაკრედიტების თანამედროვე სისტემის,კომერციული ბანკის საკასო და საინვესტიციო მომსახურების, სავალუტო და სპეციალური ოპერაციების, თანამედროვე საბანკო პროდუქტების და ტექნოლოგიების, საბანკო რისკ-მენეჯმენტის, კონტროლისა და ანგარიშგების საკითხები.'
    },
    7: {
      imgSrc: 'MainPageImages/bizsaf.jpg',
      title: 'ბიზნესის საფუძვლები',
      text: 'რევაზ ვაჩნაზე',
      summary: 'წლების განმავლობაში წინამდებარე წიგნის ავტორებს მიჰყავდათ ბიზნესის საწყისი კურსი ESM ბიზნესის სკოლაში. ESM-ის თავისუფალი უნივერსიტეტის შემადგენლობაში შესვლის შემდეგ კურსი სავალდებულო გახდა უნივერსიტეტის ყველა სტუდენტისათვის და, ბუნებრივია, გარკვეული ცვლილებები განიცადა. ორიათასიან წლებში დაწერილმა ჩვენმა სახელმძღვანელომაც თანდათან აქტუალობა დაკარგა და ამ გარემოებებმა ახალი წიგნის დაწერის გამოწვევის წინაშე დაგვაყენა.'
    }
  };

  function changeContent(boxNumber) {
    const bigImg = document.getElementById('bigImg');
    const titleElement = document.getElementById('title');
    const textElement = document.getElementById('text');
    const summaryElement = document.getElementById('summary');

    const content = boxContent[boxNumber];

    bigImg.src = content.imgSrc;
    titleElement.textContent = content.title;
    textElement.textContent = content.text;
    summaryElement.textContent = content.summary;
  }